### Terraform Plan Results

**Status:** ✅ Success

<details><summary>Show Plan</summary>

```terraform
data.external.modal_source_hash: Reading...
null_resource.control_plane_build: Refreshing state... [id=3615649605415359552]
null_resource.slack_bot_build[0]: Refreshing state... [id=49829576781955798]
module.modal_app.null_resource.modal_secrets[0]: Refreshing state... [id=2389505329356153839]
null_resource.linear_bot_build[0]: Refreshing state... [id=3417240230334063624]
module.modal_app.null_resource.modal_volume[0]: Refreshing state... [id=2222745261245959176]
module.web_app[0].vercel_project.this: Refreshing state... [id=prj_lsFieQ7HCBZcmYbZkyAjssVWupTE]
module.session_index_kv.cloudflare_workers_kv_namespace.this: Refreshing state... [id=8126febb0e7949eeb096ccf016008e02]
module.slack_kv[0].cloudflare_workers_kv_namespace.this: Refreshing state... [id=852dadc0916f4464b019669df4c142c7]
cloudflare_d1_database.main: Refreshing state... [id=da0fe8f6-a901-48fa-8824-c6adff2269bf]
module.linear_kv[0].cloudflare_workers_kv_namespace.this: Refreshing state... [id=d0fabbf492394b898704fe4ecb86c576]
module.media_bucket.cloudflare_r2_bucket.this: Refreshing state... [id=axiom-media]
null_resource.github_bot_build[0]: Refreshing state... [id=3417095460228566178]
data.external.modal_source_hash: Read complete after 0s [id=-]
module.modal_app.null_resource.modal_deploy: Refreshing state... [id=1946205910524505764]
module.web_app[0].vercel_project_environment_variable.env[1]: Refreshing state... [id=hyYORmTEGb7QbiGA]
module.web_app[0].vercel_project_environment_variable.env[4]: Refreshing state... [id=To25wBxSpilbz2ZT]
module.web_app[0].vercel_project_environment_variable.env[8]: Refreshing state... [id=b5qztvW2IoRKbypd]
module.web_app[0].vercel_project_environment_variable.env[6]: Refreshing state... [id=5zPYStrTasWDocU1]
module.web_app[0].vercel_project_environment_variable.env[3]: Refreshing state... [id=lFAairSOdfEUNp29]
module.web_app[0].vercel_project_environment_variable.env[0]: Refreshing state... [id=N0Y6OYEvBv6oBtPw]
module.web_app[0].vercel_project_environment_variable.env[7]: Refreshing state... [id=GdayJaZUCsCYgLHP]
module.web_app[0].vercel_project_environment_variable.env[5]: Refreshing state... [id=VPZ4nGZQRlCCrvpd]
module.web_app[0].vercel_project_environment_variable.env[2]: Refreshing state... [id=lbLE028PQVklqwdK]
module.slack_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=afd8e0ba9823422e894d211681438061]
module.linear_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=c1efb82478e0442ba8bef806da2f3bfd]
null_resource.d1_migrations: Refreshing state... [id=1512872248735939222]
module.slack_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=fb52fedb-c959-48d7-bf8e-f20905ad24c5]
module.linear_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=5fe94b73-a2e6-4db1-833a-d2742af3a815]
module.slack_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=237c94ab-0b20-4460-9253-0b3a3bc02fd2]
module.linear_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=7ea03cc2-6d00-47b9-a6db-0483ca64d17d]
module.control_plane_worker.cloudflare_worker.this: Refreshing state... [id=7f1c0652d79747f689ea3d298758bfa0]
module.github_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=a3025199361745048f99e43812dcb23f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # local_file.web_app_wrangler_production[0] will be created
  + resource "local_file" "web_app_wrangler_production" {
      + content              = <<-EOT
            name = "open-inspect-web-axiom"
            main = ".open-next/worker.js"
            compatibility_date = "2025-08-15"
            compatibility_flags = ["nodejs_compat", "global_fetch_strictly_public"]
            
            [vars]
            GITHUB_CLIENT_ID = "Iv23liEAFAb4nzrefZxt"
            BETTER_AUTH_URL = "https://open-inspect-web-axiom.axioshq.workers.dev"
            CONTROL_PLANE_URL = "https://open-inspect-control-plane-axiom.axioshq.workers.dev"
            NEXT_PUBLIC_WS_URL = "wss://open-inspect-control-plane-axiom.axioshq.workers.dev"
            ALLOWED_USERS = "abothra-axios,bchapman0111,bezunesh,cisarjosh,daveflr,dcumberland,drewipsonhq,ianwonghq,indi-rin,jprobst21,kaleonakakura,larrynaupari,msafranchik94,nhaggmark-axios,nodnarbnitram,ppedrazzi,rtj-1000,timothyfulmer,timreinkeaxios,tpickett,vik-wed"
            ALLOWED_EMAIL_DOMAINS = "axioshq.com"
            
            [assets]
            directory = ".open-next/assets"
            binding = "ASSETS"
            
            [[services]]
            binding = "CONTROL_PLANE_WORKER"
            service = "open-inspect-control-plane-axiom"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../..//packages/web/wrangler.production.toml"
      + id                   = (known after apply)
    }

  # null_resource.control_plane_build must be replaced
-/+ resource "null_resource" "control_plane_build" {
      ~ id       = "3615649605415359552" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-06T18:04:33Z" -> (known after apply)
        }
    }

  # null_resource.d1_migrations is tainted, so must be replaced
-/+ resource "null_resource" "d1_migrations" {
      ~ id       = "1512872248735939222" -> (known after apply)
      ~ triggers = {
          ~ "migrations_sha" = "dca33fe9042d35f8953dae68a186b579260bded43994016d95a8953e94d2f947" -> "e6fa1d961be258c444bb3480b236ca5584d5967f0ec5ba3ff21ab15cfb3fbff4"
            # (1 unchanged element hidden)
        }
    }

  # null_resource.github_bot_build[0] must be replaced
-/+ resource "null_resource" "github_bot_build" {
      ~ id       = "3417095460228566178" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-06T18:04:33Z" -> (known after apply)
        }
    }

  # null_resource.linear_bot_build[0] must be replaced
-/+ resource "null_resource" "linear_bot_build" {
      ~ id       = "3417240230334063624" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-06T18:04:34Z" -> (known after apply)
        }
    }

  # null_resource.slack_bot_build[0] must be replaced
-/+ resource "null_resource" "slack_bot_build" {
      ~ id       = "49829576781955798" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-06T18:04:33Z" -> (known after apply)
        }
    }

  # null_resource.web_app_cloudflare_build[0] will be created
  + resource "null_resource" "web_app_cloudflare_build" {
      + id       = (known after apply)
      + triggers = {
          + "always_run" = (known after apply)
        }
    }

  # null_resource.web_app_cloudflare_deploy[0] will be created
  + resource "null_resource" "web_app_cloudflare_deploy" {
      + id       = (known after apply)
      + triggers = {
          + "always_run" = (known after apply)
        }
    }

  # null_resource.web_app_cloudflare_secrets[0] will be created
  + resource "null_resource" "web_app_cloudflare_secrets" {
      + id       = (known after apply)
      + triggers = {
          + "secrets_hash" = (sensitive value)
        }
    }

  # module.control_plane_worker.cloudflare_worker_version.this will be created
  + resource "cloudflare_worker_version" "this" {
      + account_id          = "9c23776e228bd86f9ce669791dc4b82e"
      + annotations         = (known after apply)
      + bindings            = (sensitive value)
      + compatibility_date  = "2024-09-23"
      + compatibility_flags = [
          + "nodejs_compat",
        ]
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + limits              = (known after apply)
      + main_module         = "index.js"
      + modules             = [
          + {
              + content_file   = "../../..//packages/control-plane/dist/index.js"
              + content_sha256 = "f9128d61c55524bf45c7a7095d775203b8bd656789c540a351447f1e77f569c0"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      + number              = (known after apply)
      + source              = (known after apply)
      + startup_time_ms     = (known after apply)
      + usage_model         = "standard"
      + worker_id           = "7f1c0652d79747f689ea3d298758bfa0"
    }

  # module.control_plane_worker.cloudflare_workers_cron_trigger.this[0] will be created
  + resource "cloudflare_workers_cron_trigger" "this" {
      + account_id  = "9c23776e228bd86f9ce669791dc4b82e"
      + id          = (known after apply)
      + schedules   = [
          + {
              + created_on  = (known after apply)
              + cron        = "* * * * *"
              + modified_on = (known after apply)
            },
        ]
      + script_name = "open-inspect-control-plane-axiom"
    }

  # module.control_plane_worker.cloudflare_workers_deployment.this will be created
  + resource "cloudflare_workers_deployment" "this" {
      + account_id   = "9c23776e228bd86f9ce669791dc4b82e"
      + annotations  = (known after apply)
      + author_email = (known after apply)
      + created_on   = (known after apply)
      + id           = (known after apply)
      + script_name  = "open-inspect-control-plane-axiom"
      + source       = (known after apply)
      + strategy     = "percentage"
      + versions     = [
          + {
              + percentage = 100
              + version_id = (known after apply)
            },
        ]
    }

  # module.github_bot_worker[0].cloudflare_worker_version.this will be created
  + resource "cloudflare_worker_version" "this" {
      + account_id          = "9c23776e228bd86f9ce669791dc4b82e"
      + annotations         = (known after apply)
      + bindings            = (sensitive value)
      + compatibility_date  = "2024-09-23"
      + compatibility_flags = [
          + "nodejs_compat",
        ]
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + limits              = (known after apply)
      + main_module         = "index.js"
      + modules             = [
          + {
              + content_file   = "../../..//packages/github-bot/dist/index.js"
              + content_sha256 = "4cc34ac4bd764343f3e00484ca5d578adaf0104dcdaa9c8bf11b3cc5c1ee6a15"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      + number              = (known after apply)
      + source              = (known after apply)
      + startup_time_ms     = (known after apply)
      + usage_model         = "standard"
      + worker_id           = "a3025199361745048f99e43812dcb23f"
    }

  # module.github_bot_worker[0].cloudflare_workers_deployment.this will be created
  + resource "cloudflare_workers_deployment" "this" {
      + account_id   = "9c23776e228bd86f9ce669791dc4b82e"
      + annotations  = (known after apply)
      + author_email = (known after apply)
      + created_on   = (known after apply)
      + id           = (known after apply)
      + script_name  = "open-inspect-github-bot-axiom"
      + source       = (known after apply)
      + strategy     = "percentage"
      + versions     = [
          + {
              + percentage = 100
              + version_id = (known after apply)
            },
        ]
    }

  # module.linear_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-06T18:04:40Z" -> (known after apply)
      ~ id                  = "5fe94b73-a2e6-4db1-833a-d2742af3a815" -> (known after apply)
      + limits              = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_file   = "../../..//packages/linear-bot/dist/index.js" -> null
              - content_sha256 = "dc30edfff74a4c6d7d35eea64111c115ef12e5c5419fff40aad9bd55cdfe5ab2" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.js" -> null
            },
          + { # forces replacement
              + content_file   = "../../..//packages/linear-bot/dist/index.js"
              + content_sha256 = "29cf10f10fba4ece72dfdd0176195e426b5f5f5d315551d247eeff943c3c4d50"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      ~ number              = 5 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 5 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.linear_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "josh.cisar@axioshq.com" -> (known after apply)
      ~ created_on   = "2026-03-06T18:04:43Z" -> (known after apply)
      ~ id           = "7ea03cc2-6d00-47b9-a6db-0483ca64d17d" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "5fe94b73-a2e6-4db1-833a-d2742af3a815" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.modal_app.null_resource.modal_deploy must be replaced
-/+ resource "null_resource" "modal_deploy" {
      ~ id       = "1946205910524505764" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "source_hash"     = "8a8e49dd55fbb9a4e425f4582e277b3ebde13dac8a6b7076adf3e362b595521e" -> "1177d53eb6a12bb0703b154f0f485897c6f07e442aaff2acc55cb424cc600e80"
            # (3 unchanged elements hidden)
        }
    }

  # module.slack_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-06T18:04:35Z" -> (known after apply)
      ~ id                  = "fb52fedb-c959-48d7-bf8e-f20905ad24c5" -> (known after apply)
      + limits              = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_file   = "../../..//packages/slack-bot/dist/index.js" -> null
              - content_sha256 = "7f4d31dc3c1aef5350e403b900a25caea309f0ce3c2df7535cdd67b2fcc96210" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.js" -> null
            },
          + { # forces replacement
              + content_file   = "../../..//packages/slack-bot/dist/index.js"
              + content_sha256 = "5e35ef4d8b3d8fee4caac83f1757be2c691c63261981334a750d63b907c4f638"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      ~ number              = 5 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 4 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.slack_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "josh.cisar@axioshq.com" -> (known after apply)
      ~ created_on   = "2026-03-06T18:04:36Z" -> (known after apply)
      ~ id           = "237c94ab-0b20-4460-9253-0b3a3bc02fd2" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "fb52fedb-c959-48d7-bf8e-f20905ad24c5" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.web_app[0].vercel_project.this will be destroyed
  # (because module.web_app[0] is not in configuration)
  - resource "vercel_project" "this" {
      - auto_assign_custom_domains                        = true -> null
      - automatically_expose_system_environment_variables = false -> null
      - build_command                                     = "next build" -> null
      - customer_success_code_visibility                  = false -> null
      - directory_listing                                 = false -> null
      - framework                                         = "nextjs" -> null
      - function_failover                                 = false -> null
      - git_fork_protection                               = true -> null
      - git_lfs                                           = false -> null
      - id                                                = "prj_lsFieQ7HCBZcmYbZkyAjssVWupTE" -> null
      - install_command                                   = "cd ../.. && npm install && npm run build -w @open-inspect/shared" -> null
      - name                                              = "open-inspect-axiom" -> null
      - node_version                                      = "24.x" -> null
      - oidc_token_config                                 = {
          - enabled     = false -> null
          - issuer_mode = "global" -> null
        } -> null
      - prioritise_production_builds                      = false -> null
      - resource_config                                   = {
          - fluid = true -> null
        } -> null
      - root_directory                                    = "packages/web" -> null
      - serverless_function_region                        = "iad1" -> null
      - team_id                                           = "team_OZLy0gKxBkFulUj7vtVTZurk" -> null
      - vercel_authentication                             = {
          - deployment_type = "standard_protection" -> null
        } -> null
    }

  # module.web_app[0].vercel_project_environment_variable.env[0] will be destroyed
  # (because module.web_app[0] is not in configuration)
  - resource "vercel_project_environment_variable" "env" {
      - custom_environment_ids = [] -> null
      - id                     = "N0Y6OYEvBv6oBtPw" -> null
      - key                    = (sensitive value) -> null
      - project_id             = "prj_lsFieQ7HCBZcmYbZkyAjssVWupTE" -> null
      - sensitive              = (sensitive value) -> null
      - target                 = (sensitive value) -> null
      - team_id                = "team_OZLy0gKxBkFulUj7vtVTZurk" -> null
      - value                  = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # module.web_app[0].vercel_project_environment_variable.env[1] will be destroyed
  # (because module.web_app[0] is not in configuration)
  - resource "vercel_project_environment_variable" "env" {
      - custom_environment_ids = [] -> null
      - id                     = "hyYORmTEGb7QbiGA" -> null
      - key                    = (sensitive value) -> null
      - project_id             = "prj_lsFieQ7HCBZcmYbZkyAjssVWupTE" -> null
      - sensitive              = (sensitive value) -> null
      - target                 = (sensitive value) -> null
      - team_id                = "team_OZLy0gKxBkFulUj7vtVTZurk" -> null
      - value                  = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # module.web_app[0].vercel_project_environment_variable.env[2] will be destroyed
  # (because module.web_app[0] is not in configuration)
  - resource "vercel_project_environment_variable" "env" {
      - custom_environment_ids = [] -> null
      - id                     = "lbLE028PQVklqwdK" -> null
      - key                    = (sensitive value) -> null
      - project_id             = "prj_lsFieQ7HCBZcmYbZkyAjssVWupTE" -> null
      - sensitive              = (sensitive value) -> null
      - target                 = (sensitive value) -> null
      - team_id                = "team_OZLy0gKxBkFulUj7vtVTZurk" -> null
      - value                  = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # module.web_app[0].vercel_project_environment_variable.env[3] will be destroyed
  # (because module.web_app[0] is not in configuration)
  - resource "vercel_project_environment_variable" "env" {
      - custom_environment_ids = [] -> null
      - id                     = "lFAairSOdfEUNp29" -> null
      - key                    = (sensitive value) -> null
      - project_id             = "prj_lsFieQ7HCBZcmYbZkyAjssVWupTE" -> null
      - sensitive              = (sensitive value) -> null
      - target                 = (sensitive value) -> null
      - team_id                = "team_OZLy0gKxBkFulUj7vtVTZurk" -> null
      - value                  = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # module.web_app[0].vercel_project_environment_variable.env[4] will be destroyed
  # (because module.web_app[0] is not in configuration)
  - resource "vercel_project_environment_variable" "env" {
      - custom_environment_ids = [] -> null
      - id                     = "To25wBxSpilbz2ZT" -> null
      - key                    = (sensitive value) -> null
      - project_id             = "prj_lsFieQ7HCBZcmYbZkyAjssVWupTE" -> null
      - sensitive              = (sensitive value) -> null
      - target                 = (sensitive value) -> null
      - team_id                = "team_OZLy0gKxBkFulUj7vtVTZurk" -> null
      - value                  = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # module.web_app[0].vercel_project_environment_variable.env[5] will be destroyed
  # (because module.web_app[0] is not in configuration)
  - resource "vercel_project_environment_variable" "env" {
      - custom_environment_ids = [] -> null
      - id                     = "VPZ4nGZQRlCCrvpd" -> null
      - key                    = (sensitive value) -> null
      - project_id             = "prj_lsFieQ7HCBZcmYbZkyAjssVWupTE" -> null
      - sensitive              = (sensitive value) -> null
      - target                 = (sensitive value) -> null
      - team_id                = "team_OZLy0gKxBkFulUj7vtVTZurk" -> null
      - value                  = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # module.web_app[0].vercel_project_environment_variable.env[6] will be destroyed
  # (because module.web_app[0] is not in configuration)
  - resource "vercel_project_environment_variable" "env" {
      - custom_environment_ids = [] -> null
      - id                     = "5zPYStrTasWDocU1" -> null
      - key                    = (sensitive value) -> null
      - project_id             = "prj_lsFieQ7HCBZcmYbZkyAjssVWupTE" -> null
      - sensitive              = (sensitive value) -> null
      - target                 = (sensitive value) -> null
      - team_id                = "team_OZLy0gKxBkFulUj7vtVTZurk" -> null
      - value                  = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # module.web_app[0].vercel_project_environment_variable.env[7] will be destroyed
  # (because module.web_app[0] is not in configuration)
  - resource "vercel_project_environment_variable" "env" {
      - custom_environment_ids = [] -> null
      - id                     = "GdayJaZUCsCYgLHP" -> null
      - key                    = (sensitive value) -> null
      - project_id             = "prj_lsFieQ7HCBZcmYbZkyAjssVWupTE" -> null
      - sensitive              = (sensitive value) -> null
      - target                 = (sensitive value) -> null
      - team_id                = "team_OZLy0gKxBkFulUj7vtVTZurk" -> null
      - value                  = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # module.web_app[0].vercel_project_environment_variable.env[8] will be destroyed
  # (because module.web_app[0] is not in configuration)
  - resource "vercel_project_environment_variable" "env" {
      - custom_environment_ids = [] -> null
      - id                     = "b5qztvW2IoRKbypd" -> null
      - key                    = (sensitive value) -> null
      - project_id             = "prj_lsFieQ7HCBZcmYbZkyAjssVWupTE" -> null
      - sensitive              = (sensitive value) -> null
      - target                 = (sensitive value) -> null
      - team_id                = "team_OZLy0gKxBkFulUj7vtVTZurk" -> null
      - value                  = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

Plan: 19 to add, 0 to change, 20 to destroy.

Changes to Outputs:
  ~ verification_commands          = <<-EOT
        # 1. Health check control plane
        curl https://open-inspect-control-plane-axiom.workers.dev/health
        
        # 2. Health check Modal
        curl https://josh-cisar--open-inspect-api-health.modal.run
        
        # 3. Verify web app deployment
      - curl https://open-inspect-axiom.vercel.app
      + curl https://open-inspect-web-axiom.axioshq.workers.dev
        
        # 4. Test authenticated endpoint (should return 401)
        curl https://open-inspect-control-plane-axiom.workers.dev/sessions
    EOT
  ~ web_app_platform               = "vercel" -> "cloudflare"
  - web_app_project_id             = "prj_lsFieQ7HCBZcmYbZkyAjssVWupTE" -> null
  ~ web_app_url                    = "https://open-inspect-axiom.vercel.app" -> "https://open-inspect-web-axiom.axioshq.workers.dev"

Warning: Resource Destruction Considerations

  with module.control_plane_worker.cloudflare_workers_cron_trigger.this[0],
  on ../../modules/cloudflare-worker/main.tf line 159, in resource "cloudflare_workers_cron_trigger" "this":
 159: resource "cloudflare_workers_cron_trigger" "this" {

This resource cannot be destroyed from Terraform. If you create this
resource, it will be present in the API until manually deleted.

Error: Invalid index

  on checks.tf line 9, in check "vercel_url_matches":
   9:       module.web_app[0].production_url == local.web_app_url
    ├────────────────
    │ module.web_app is empty tuple

The given key does not identify an element in this collection value: the
collection has no elements.
::error::Terraform exited with code 1.
```

</details>

*Pushed by: @CisarJosh*